In [4]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import OneHotEncoder, LabelEncoder
from sklearn.metrics import accuracy_score, confusion_matrix
from sklearn.compose import ColumnTransformer
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [5]:
df = pd.read_csv("train.csv")
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [6]:
df2 = df.drop(['Name','Ticket','Cabin','PassengerId'],axis=1)
df2.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [7]:
df2.isna().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [33]:
df2['Age'].fillna(value=df2['Age'].median(),inplace=True)

In [34]:
df2['Age'].median()

28.0

In [35]:
df2.isna().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    2
dtype: int64

In [36]:
df3 = df2.dropna()

df3.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [37]:
df3.Embarked.unique()

array(['S', 'C', 'Q'], dtype=object)

In [38]:
label = LabelEncoder()

df3['gender'] = label.fit_transform(df3['Sex'])
df3['embarked'] = label.fit_transform(df3['Embarked'])

df3.head()

<ipython-input-38-de8a08ee6ba7>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['gender'] = label.fit_transform(df3['Sex'])
<ipython-input-38-de8a08ee6ba7>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['embarked'] = label.fit_transform(df3['Embarked'])

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,gender,embarked
0,0,3,male,22.0,1,0,7.2500,S,1,2
1,1,1,female,38.0,1,0,71.2833,C,0,0
2,1,3,female,26.0,0,0,7.9250,S,0,2
3,1,1,female,35.0,1,0,53.1000,S,0,2
4,0,3,male,35.0,0,0,8.0500,S,1,2

In [39]:
df3.drop(['Sex','Embarked'],axis=1,inplace=True)
df3.head()

C:\Users\Admin\anaconda3\lib\site-packages\pandas\core\frame.py:4308: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

   Survived  Pclass   Age  SibSp  Parch     Fare  gender  embarked
0         0       3  22.0      1      0   7.2500       1         2
1         1       1  38.0      1      0  71.2833       0         0
2         1       3  26.0      0      0   7.9250       0         2
3         1       1  35.0      1      0  53.1000       0         2
4         0       3  35.0      0      0   8.0500       1         2

In [40]:
X = df3.drop(['Survived'],axis=1)
y = df3['Survived']

In [41]:
X.head()

   Pclass   Age  SibSp  Parch     Fare  gender  embarked
0       3  22.0      1      0   7.2500       1         2
1       1  38.0      1      0  71.2833       0         0
2       3  26.0      0      0   7.9250       0         2
3       1  35.0      1      0  53.1000       0         2
4       3  35.0      0      0   8.0500       1         2

In [42]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [43]:
len(X),len(y)

(889, 889)

In [44]:
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.2)

In [45]:
len(X_train),len(y_train),len(X_test),len(y_test)

(711, 711, 178, 178)

In [46]:
log_reg = LogisticRegression()
rforest = RandomForestClassifier()
dectree = DecisionTreeClassifier()

rforest.fit(X_train,y_train)
log_reg.fit(X_train, y_train)
dectree.fit(X_train, y_train)

DecisionTreeClassifier()

In [47]:
print("Logistic Regression (Train _ Test) score is: ",log_reg.score(X_test,y_test),'_',log_reg.score(X_train,y_train))
print("Random Forest Classifier (Train _ Test) score is: ",rforest.score(X_test,y_test),'_',rforest.score(X_train,y_train))
print("Decision Tree Classifier (Train _ Test) score is: ",dectree.score(X_test,y_test),'_',dectree.score(X_train,y_train))

Logistic Regression (Train _ Test) score is:  0.797752808988764 _ 0.8002812939521801
Random Forest Classifier (Train _ Test) score is:  0.8707865168539326 _ 0.980309423347398
Decision Tree Classifier (Train _ Test) score is:  0.8202247191011236 _ 0.980309423347398

In [48]:
preds = rforest.predict(X_test)

In [49]:
confusion_matrix(y_test,preds)

array([[98, 11],
       [12, 57]], dtype=int64)